testZadanie.yml
config:
  target: "https://postcodes.io/"
  phases:
    - duration: 100
      arrivalRate: 2
      name: Artillery Test
  payload:
    -
      path: "postcodes.csv"
      fields:
        - "postcodes1"
      order: sequence
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{{ target }}}random/postcodes"
      - post:
          url: "{{ target }}postcodes?param1={{ **postcodes1** }}"
          json:
            postcodes: ["CustomCode1"]
          expect:
            statusCode: [200, 201]
ensure:
  thresholds:
    - http.response_time.p95: 1000
  conditions:
    - expression: vusers.failed == 0
    - expression: "http.request_rate >= 2 and http.response_time.max < 600"